base/redis_bench_result/get_32_6412.log
2023-11-24 12:11:01
====== GET ======
  20000008 requests completed in 195.71 seconds
  32 parallel clients
  32 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.12% <= 0.2 milliseconds
2.77% <= 0.3 milliseconds
6.52% <= 0.4 milliseconds
10.68% <= 0.5 milliseconds
15.71% <= 0.6 milliseconds
21.49% <= 0.7 milliseconds
27.20% <= 0.8 milliseconds
32.44% <= 0.9 milliseconds
36.89% <= 1.0 milliseconds
40.58% <= 1.1 milliseconds
43.83% <= 1.2 milliseconds
46.90% <= 1.3 milliseconds
49.85% <= 1.4 milliseconds
52.61% <= 1.5 milliseconds
55.17% <= 1.6 milliseconds
57.59% <= 1.7 milliseconds
59.88% <= 1.8 milliseconds
62.08% <= 1.9 milliseconds
64.17% <= 2 milliseconds
79.18% <= 3 milliseconds
87.23% <= 4 milliseconds
91.74% <= 5 milliseconds
94.33% <= 6 milliseconds
95.93% <= 7 milliseconds
96.95% <= 8 milliseconds
97.69% <= 9 milliseconds
98.18% <= 10 milliseconds
98.52% <= 11 milliseconds
98.78% <= 12 milliseconds
98.98% <= 13 milliseconds
99.14% <= 14 milliseconds
99.26% <= 15 milliseconds
99.38% <= 16 milliseconds
99.47% <= 17 milliseconds
99.54% <= 18 milliseconds
99.61% <= 19 milliseconds
99.66% <= 20 milliseconds
99.70% <= 21 milliseconds
99.74% <= 22 milliseconds
99.77% <= 23 milliseconds
99.79% <= 24 milliseconds
99.82% <= 25 milliseconds
99.84% <= 26 milliseconds
99.85% <= 27 milliseconds
99.87% <= 28 milliseconds
99.88% <= 29 milliseconds
99.89% <= 30 milliseconds
99.91% <= 31 milliseconds
99.91% <= 32 milliseconds
99.92% <= 33 milliseconds
99.93% <= 34 milliseconds
99.94% <= 35 milliseconds
99.95% <= 36 milliseconds
99.95% <= 37 milliseconds
99.95% <= 38 milliseconds
99.96% <= 39 milliseconds
99.97% <= 40 milliseconds
99.97% <= 41 milliseconds
99.97% <= 42 milliseconds
99.98% <= 43 milliseconds
99.98% <= 44 milliseconds
99.98% <= 45 milliseconds
99.98% <= 46 milliseconds
99.98% <= 47 milliseconds
99.98% <= 48 milliseconds
99.98% <= 49 milliseconds
99.99% <= 50 milliseconds
99.99% <= 51 milliseconds
99.99% <= 52 milliseconds
99.99% <= 53 milliseconds
99.99% <= 54 milliseconds
99.99% <= 55 milliseconds
99.99% <= 56 milliseconds
99.99% <= 57 milliseconds
99.99% <= 58 milliseconds
100.00% <= 61 milliseconds
100.00% <= 62 milliseconds
100.00% <= 65 milliseconds
100.00% <= 66 milliseconds
100.00% <= 74 milliseconds
100.00% <= 75 milliseconds
100.00% <= 76 milliseconds
100.00% <= 77 milliseconds
100.00% <= 77 milliseconds
102191.54 requests per second