base/redis_bench_result/get_64_6395.log
2023-11-24 12:47:05
====== GET ======
  20000000 requests completed in 211.50 seconds
  32 parallel clients
  64 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.03% <= 0.2 milliseconds
1.42% <= 0.3 milliseconds
3.84% <= 0.4 milliseconds
6.97% <= 0.5 milliseconds
12.30% <= 0.6 milliseconds
18.85% <= 0.7 milliseconds
25.49% <= 0.8 milliseconds
31.83% <= 0.9 milliseconds
36.70% <= 1.0 milliseconds
40.08% <= 1.1 milliseconds
42.80% <= 1.2 milliseconds
45.31% <= 1.3 milliseconds
47.72% <= 1.4 milliseconds
50.04% <= 1.5 milliseconds
52.28% <= 1.6 milliseconds
54.43% <= 1.7 milliseconds
56.52% <= 1.8 milliseconds
58.56% <= 1.9 milliseconds
60.45% <= 2 milliseconds
75.00% <= 3 milliseconds
83.67% <= 4 milliseconds
88.82% <= 5 milliseconds
92.01% <= 6 milliseconds
94.05% <= 7 milliseconds
95.42% <= 8 milliseconds
96.38% <= 9 milliseconds
97.10% <= 10 milliseconds
97.65% <= 11 milliseconds
98.08% <= 12 milliseconds
98.43% <= 13 milliseconds
98.69% <= 14 milliseconds
98.90% <= 15 milliseconds
99.06% <= 16 milliseconds
99.20% <= 17 milliseconds
99.32% <= 18 milliseconds
99.42% <= 19 milliseconds
99.50% <= 20 milliseconds
99.57% <= 21 milliseconds
99.62% <= 22 milliseconds
99.67% <= 23 milliseconds
99.71% <= 24 milliseconds
99.74% <= 25 milliseconds
99.76% <= 26 milliseconds
99.79% <= 27 milliseconds
99.81% <= 28 milliseconds
99.82% <= 29 milliseconds
99.84% <= 30 milliseconds
99.86% <= 31 milliseconds
99.87% <= 32 milliseconds
99.88% <= 33 milliseconds
99.90% <= 34 milliseconds
99.91% <= 35 milliseconds
99.92% <= 36 milliseconds
99.93% <= 37 milliseconds
99.94% <= 38 milliseconds
99.94% <= 39 milliseconds
99.95% <= 40 milliseconds
99.96% <= 41 milliseconds
99.96% <= 42 milliseconds
99.97% <= 43 milliseconds
99.97% <= 44 milliseconds
99.97% <= 45 milliseconds
99.97% <= 46 milliseconds
99.97% <= 47 milliseconds
99.98% <= 48 milliseconds
99.98% <= 49 milliseconds
99.98% <= 50 milliseconds
99.98% <= 51 milliseconds
99.98% <= 52 milliseconds
99.98% <= 53 milliseconds
99.99% <= 56 milliseconds
99.99% <= 57 milliseconds
99.99% <= 58 milliseconds
99.99% <= 61 milliseconds
99.99% <= 62 milliseconds
99.99% <= 63 milliseconds
99.99% <= 64 milliseconds
99.99% <= 65 milliseconds
100.00% <= 66 milliseconds
100.00% <= 67 milliseconds
100.00% <= 68 milliseconds
100.00% <= 72 milliseconds
100.00% <= 73 milliseconds
100.00% <= 74 milliseconds
100.00% <= 77 milliseconds
100.00% <= 78 milliseconds
100.00% <= 80 milliseconds
100.00% <= 80 milliseconds
94563.54 requests per second