base/redis_bench_result/set_16_6431.log
2023-11-24 11:48:19
====== SET ======
  20000008 requests completed in 205.93 seconds
  32 parallel clients
  16 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.16% <= 0.2 milliseconds
2.32% <= 0.3 milliseconds
4.94% <= 0.4 milliseconds
9.36% <= 0.5 milliseconds
15.58% <= 0.6 milliseconds
22.51% <= 0.7 milliseconds
29.12% <= 0.8 milliseconds
33.63% <= 0.9 milliseconds
37.15% <= 1.0 milliseconds
40.64% <= 1.1 milliseconds
44.06% <= 1.2 milliseconds
47.19% <= 1.3 milliseconds
49.93% <= 1.4 milliseconds
52.38% <= 1.5 milliseconds
54.68% <= 1.6 milliseconds
56.88% <= 1.7 milliseconds
58.93% <= 1.8 milliseconds
60.88% <= 1.9 milliseconds
62.69% <= 2 milliseconds
76.00% <= 3 milliseconds
83.87% <= 4 milliseconds
88.68% <= 5 milliseconds
91.64% <= 6 milliseconds
93.70% <= 7 milliseconds
95.12% <= 8 milliseconds
96.16% <= 9 milliseconds
96.93% <= 10 milliseconds
97.50% <= 11 milliseconds
97.96% <= 12 milliseconds
98.33% <= 13 milliseconds
98.58% <= 14 milliseconds
98.82% <= 15 milliseconds
99.03% <= 16 milliseconds
99.15% <= 17 milliseconds
99.28% <= 18 milliseconds
99.39% <= 19 milliseconds
99.47% <= 20 milliseconds
99.55% <= 21 milliseconds
99.61% <= 22 milliseconds
99.67% <= 23 milliseconds
99.71% <= 24 milliseconds
99.75% <= 25 milliseconds
99.78% <= 26 milliseconds
99.81% <= 27 milliseconds
99.83% <= 28 milliseconds
99.86% <= 29 milliseconds
99.87% <= 30 milliseconds
99.89% <= 31 milliseconds
99.90% <= 32 milliseconds
99.91% <= 33 milliseconds
99.92% <= 34 milliseconds
99.92% <= 35 milliseconds
99.93% <= 36 milliseconds
99.93% <= 37 milliseconds
99.94% <= 38 milliseconds
99.95% <= 39 milliseconds
99.95% <= 40 milliseconds
99.96% <= 41 milliseconds
99.96% <= 42 milliseconds
99.96% <= 43 milliseconds
99.96% <= 44 milliseconds
99.97% <= 45 milliseconds
99.97% <= 46 milliseconds
99.97% <= 47 milliseconds
99.97% <= 48 milliseconds
99.98% <= 49 milliseconds
99.98% <= 50 milliseconds
99.98% <= 51 milliseconds
99.98% <= 52 milliseconds
99.98% <= 53 milliseconds
99.98% <= 54 milliseconds
99.98% <= 55 milliseconds
99.99% <= 57 milliseconds
99.99% <= 58 milliseconds
99.99% <= 59 milliseconds
99.99% <= 61 milliseconds
99.99% <= 62 milliseconds
99.99% <= 63 milliseconds
99.99% <= 64 milliseconds
99.99% <= 65 milliseconds
99.99% <= 66 milliseconds
99.99% <= 67 milliseconds
99.99% <= 69 milliseconds
100.00% <= 70 milliseconds
100.00% <= 71 milliseconds
100.00% <= 74 milliseconds
100.00% <= 75 milliseconds
100.00% <= 76 milliseconds
100.00% <= 77 milliseconds
100.00% <= 84 milliseconds
100.00% <= 85 milliseconds
100.00% <= 85 milliseconds
97121.37 requests per second