base/redis_bench_result/set_16_6445.log
2023-11-24 11:48:20
====== SET ======
  20000016 requests completed in 216.23 seconds
  32 parallel clients
  16 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.10% <= 0.2 milliseconds
1.79% <= 0.3 milliseconds
4.13% <= 0.4 milliseconds
7.35% <= 0.5 milliseconds
12.52% <= 0.6 milliseconds
18.44% <= 0.7 milliseconds
24.76% <= 0.8 milliseconds
30.19% <= 0.9 milliseconds
34.26% <= 1.0 milliseconds
37.78% <= 1.1 milliseconds
41.06% <= 1.2 milliseconds
44.14% <= 1.3 milliseconds
46.98% <= 1.4 milliseconds
49.55% <= 1.5 milliseconds
51.92% <= 1.6 milliseconds
54.14% <= 1.7 milliseconds
56.23% <= 1.8 milliseconds
58.22% <= 1.9 milliseconds
60.13% <= 2 milliseconds
74.36% <= 3 milliseconds
82.85% <= 4 milliseconds
88.00% <= 5 milliseconds
91.31% <= 6 milliseconds
93.43% <= 7 milliseconds
94.88% <= 8 milliseconds
95.96% <= 9 milliseconds
96.74% <= 10 milliseconds
97.33% <= 11 milliseconds
97.84% <= 12 milliseconds
98.21% <= 13 milliseconds
98.53% <= 14 milliseconds
98.76% <= 15 milliseconds
98.96% <= 16 milliseconds
99.13% <= 17 milliseconds
99.25% <= 18 milliseconds
99.36% <= 19 milliseconds
99.45% <= 20 milliseconds
99.52% <= 21 milliseconds
99.59% <= 22 milliseconds
99.65% <= 23 milliseconds
99.70% <= 24 milliseconds
99.74% <= 25 milliseconds
99.78% <= 26 milliseconds
99.81% <= 27 milliseconds
99.83% <= 28 milliseconds
99.85% <= 29 milliseconds
99.86% <= 30 milliseconds
99.88% <= 31 milliseconds
99.89% <= 32 milliseconds
99.90% <= 33 milliseconds
99.91% <= 34 milliseconds
99.92% <= 35 milliseconds
99.93% <= 36 milliseconds
99.93% <= 37 milliseconds
99.94% <= 38 milliseconds
99.94% <= 39 milliseconds
99.95% <= 40 milliseconds
99.95% <= 41 milliseconds
99.95% <= 42 milliseconds
99.96% <= 43 milliseconds
99.96% <= 44 milliseconds
99.96% <= 45 milliseconds
99.96% <= 46 milliseconds
99.96% <= 47 milliseconds
99.97% <= 48 milliseconds
99.97% <= 49 milliseconds
99.97% <= 50 milliseconds
99.97% <= 51 milliseconds
99.97% <= 52 milliseconds
99.97% <= 53 milliseconds
99.98% <= 54 milliseconds
99.98% <= 55 milliseconds
99.98% <= 56 milliseconds
99.98% <= 57 milliseconds
99.98% <= 58 milliseconds
99.98% <= 59 milliseconds
99.98% <= 60 milliseconds
99.98% <= 61 milliseconds
99.99% <= 62 milliseconds
99.99% <= 63 milliseconds
99.99% <= 64 milliseconds
99.99% <= 66 milliseconds
99.99% <= 67 milliseconds
99.99% <= 68 milliseconds
99.99% <= 69 milliseconds
99.99% <= 70 milliseconds
99.99% <= 71 milliseconds
99.99% <= 76 milliseconds
99.99% <= 77 milliseconds
99.99% <= 78 milliseconds
99.99% <= 80 milliseconds
99.99% <= 81 milliseconds
99.99% <= 82 milliseconds
99.99% <= 83 milliseconds
99.99% <= 84 milliseconds
99.99% <= 85 milliseconds
99.99% <= 93 milliseconds
100.00% <= 94 milliseconds
100.00% <= 95 milliseconds
100.00% <= 96 milliseconds
100.00% <= 97 milliseconds
100.00% <= 98 milliseconds
100.00% <= 99 milliseconds
100.00% <= 100 milliseconds
100.00% <= 101 milliseconds
100.00% <= 112 milliseconds
100.00% <= 112 milliseconds
92492.89 requests per second