base/redis_bench_result/set_16_6489.log
2023-11-24 11:48:21
====== SET ======
  20000008 requests completed in 224.47 seconds
  32 parallel clients
  16 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.10% <= 0.2 milliseconds
1.96% <= 0.3 milliseconds
4.16% <= 0.4 milliseconds
7.05% <= 0.5 milliseconds
11.27% <= 0.6 milliseconds
16.24% <= 0.7 milliseconds
21.62% <= 0.8 milliseconds
26.37% <= 0.9 milliseconds
30.35% <= 1.0 milliseconds
33.99% <= 1.1 milliseconds
37.48% <= 1.2 milliseconds
40.72% <= 1.3 milliseconds
43.71% <= 1.4 milliseconds
46.46% <= 1.5 milliseconds
49.03% <= 1.6 milliseconds
51.48% <= 1.7 milliseconds
53.87% <= 1.8 milliseconds
56.14% <= 1.9 milliseconds
58.29% <= 2 milliseconds
73.94% <= 3 milliseconds
82.82% <= 4 milliseconds
88.09% <= 5 milliseconds
91.32% <= 6 milliseconds
93.46% <= 7 milliseconds
94.95% <= 8 milliseconds
96.02% <= 9 milliseconds
96.80% <= 10 milliseconds
97.40% <= 11 milliseconds
97.85% <= 12 milliseconds
98.24% <= 13 milliseconds
98.52% <= 14 milliseconds
98.75% <= 15 milliseconds
98.94% <= 16 milliseconds
99.07% <= 17 milliseconds
99.20% <= 18 milliseconds
99.30% <= 19 milliseconds
99.38% <= 20 milliseconds
99.45% <= 21 milliseconds
99.51% <= 22 milliseconds
99.57% <= 23 milliseconds
99.61% <= 24 milliseconds
99.65% <= 25 milliseconds
99.68% <= 26 milliseconds
99.72% <= 27 milliseconds
99.75% <= 28 milliseconds
99.78% <= 29 milliseconds
99.81% <= 30 milliseconds
99.82% <= 31 milliseconds
99.84% <= 32 milliseconds
99.85% <= 33 milliseconds
99.87% <= 34 milliseconds
99.88% <= 35 milliseconds
99.88% <= 36 milliseconds
99.89% <= 37 milliseconds
99.90% <= 38 milliseconds
99.91% <= 39 milliseconds
99.91% <= 40 milliseconds
99.92% <= 41 milliseconds
99.92% <= 42 milliseconds
99.93% <= 43 milliseconds
99.93% <= 44 milliseconds
99.94% <= 45 milliseconds
99.95% <= 46 milliseconds
99.95% <= 47 milliseconds
99.95% <= 48 milliseconds
99.96% <= 49 milliseconds
99.96% <= 50 milliseconds
99.96% <= 51 milliseconds
99.96% <= 52 milliseconds
99.97% <= 53 milliseconds
99.97% <= 54 milliseconds
99.97% <= 55 milliseconds
99.97% <= 56 milliseconds
99.98% <= 57 milliseconds
99.98% <= 58 milliseconds
99.98% <= 59 milliseconds
99.98% <= 60 milliseconds
99.99% <= 61 milliseconds
99.99% <= 62 milliseconds
99.99% <= 64 milliseconds
99.99% <= 65 milliseconds
99.99% <= 66 milliseconds
99.99% <= 72 milliseconds
99.99% <= 73 milliseconds
99.99% <= 74 milliseconds
99.99% <= 77 milliseconds
99.99% <= 80 milliseconds
99.99% <= 91 milliseconds
99.99% <= 92 milliseconds
99.99% <= 93 milliseconds
100.00% <= 94 milliseconds
100.00% <= 101 milliseconds
100.00% <= 102 milliseconds
100.00% <= 119 milliseconds
100.00% <= 122 milliseconds
100.00% <= 125 milliseconds
100.00% <= 126 milliseconds
100.00% <= 128 milliseconds
100.00% <= 129 milliseconds
100.00% <= 129 milliseconds
89097.21 requests per second